modules/adsplatform/views/ad/index.php

                ],
                'title',
                //'subtitle',
                [
                    'attribute' => 'position_id',
                    'value' => function($data){
                        $result = Position::findOne($data->position_id);
                        return $result['name'];
                    },
                    'options' => [
                        'colgroup'=>['col'=>2]
                    ]
                ],
---
SELECT * FROM `position` WHERE `id`=1