modules/adsplatform/views/strategy/index.php

SELECT * FROM `position` WHERE `id`=1
---
                [
                    'attribute' => 'position_id',
                    'value' => function($data){
                        $result = Position::findOne($data->position_id);