modules/adsplatform/controllers/StrategyController.php

    public function actionView($id)
    {
        $searchadlistModel = new StrategyAdListSearch();
        $searchadlistModel->strategy_id = $id;
        $dataProvider_adlist = $searchadlistModel->search(Yii::$app->request->queryParams);

        $searchModel = new StrategyListSearch();
        $searchModel->strategy_id = $id;
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        $strategy_name = Strategy::findOne($id);

        if (Yii::$app->request->isAjax) {
            return $this->renderAjax('view', [
                'model' => $this->findModel($id),
                'searchModel' => $searchModel,
                'dataProvider' => $dataProvider,
                'dataProvider_adlist' => $dataProvider_adlist,
                'searchadlistModel' => $searchadlistModel,
                'strategy_name' => $strategy_name['name']
            ]);
---
SELECT * FROM `strategy` WHERE `id`='1'