modules/adsplatform/models/Datadict.php

    public static function getDataValue ($type, $key){
        $db = Yii::$app->db;
        $dep = new DbDependency();
        $dep->sql = 'SELECT count(*) FROM '.self::tableName();
        $result = $db->cache(function($db) use($type, $key){
           return self::find()
               ->select('value')
                ->where('type=:t and `key`=:k and status=:s', [':t' => $type, ':k' => $key, ':s'=> self::$status])
               ->orderBy('sort')
                ->one();
---
SELECT `value` FROM `datadict` WHERE type='strategy_list_type' and `key`=5 and status=1 ORDER BY `sort`

    public static function getDataList($type, $unset= true){
        $db = Yii::$app->db;// or Category::getDb()
        $dep = new DbDependency();
        $dep->sql = 'SELECT count(*) FROM '.self::tableName();
        $result = $db->cache(function ($db) use ($type) {
            return self::find()
                ->select('`key`, `value`')
                ->where('type=:t and status=:s', [':t' => $type, ':s'=> self::$status])
                ->orderBy('sort')
                ->asArray()
                ->all();
---
SELECT `key`, `value` FROM `datadict` WHERE type='strategy_list_status' and status=1 ORDER BY `sort`