modules/adsplatform/views/strategy-ad-list/index.php

SELECT * FROM `strategy` WHERE `id`=1
---
                [
                    'attribute' => 'strategy_id',
                    'value' => function($data){
                        $result = Strategy::findOne($data->strategy_id);